Tekla.Structures.Model.NullRulingException
This class represent an exception thrown when a ruling of the lofted plate (i.e. the lines that swipe the plate
surface between the base curves) would become zero because of a lofted plate operation

Tekla.Structures.Model.NullRulingException.#ctor
Constructs an instance of the class